<?php

namespace Database\Factories;

use Illuminate\Database\Eloquent\Factories\Factory;
use Illuminate\Support\Facades\Hash;
use Illuminate\Support\Str;

/**
 * @extends \Illuminate\Database\Eloquent\Factories\Factory<\App\Models\User>
 */
class UserFactory extends Factory
{
    /**
     * The current password being used by the factory.
     */
    protected static ?string $password;

    /**
     * Define the model's default state.
     *
     * @return array<string, mixed>
     */
    public function definition(): array
    {

        $firstNames = [
            'آرمین', 'آرمیتا', 'آزاده', 'آرش', 'آرمان', 'آزیتا', 'آتنا', 'آیدا', 'آناهیتا', 'آوا',
            'احسان', 'ادریس', 'ارسلان', 'ارغوان', 'الناز', 'النا', 'الهام', 'امیر', 'امین', 'انوشا',
            'بیتا', 'بهنام', 'بهنوش', 'بهداد', 'بهزاد', 'بهار', 'بهرام', 'بهناز', 'بنفشه', 'بهنیا',
            'پروین', 'پگاه', 'پریسا', 'پویان', 'پژمان', 'پیمان', 'پناه', 'پویا', 'پریا', 'پروانه',
            'تارا', 'ترانه', 'توران', 'تورج', 'تهران', 'توفیق', 'تهمینه', 'تیام', 'توماج', 'تکتم',
            'ثریا', 'ثمین', 'ثنا', 'ثابت', 'ثامر', 'ثمین', 'ثروت', 'ثاقب', 'ثنا', 'ثانیه',
            'جلال', 'جواد', 'جمشید', 'جهانگیر', 'جهان', 'جمال', 'جمیل', 'جهانبخش', 'جهانشاه', 'جوان',
            'چکامه', 'چکاد', 'چکاوک', 'چمران', 'چنگیز', 'چمران', 'چنار', 'چیستا', 'چیستا', 'چشمک',
            'حامد', 'حمید', 'حسن', 'حسین', 'حبیب', 'حدیث', 'حافظ', 'حامد', 'حامد', 'حبیب'
        ];

        $lastNames = [
            'احمدی', 'محمدی', 'رضایی', 'کریمی', 'حسینی', 'صادقی', 'مرادی', 'زارع', 'علیزاده', 'جعفری',
            'رحیمی', 'شریفی', 'عباسی', 'حیدری', 'قاسمی', 'سلیمانی', 'نوری', 'کاظمی', 'رفیعی', 'موسوی',
            'اکبری', 'امیری', 'سعیدی', 'باقری', 'پناهی', 'خانی', 'نوروزی', 'تقی‌زاده', 'عبدی', 'صمدی',
            'کریمی', 'خسروی', 'حکیمی', 'معصومی', 'یزدی', 'هاشمی', 'دانش', 'دولت‌آبادی', 'طالبی', 'اسدی',
            'مهدوی', 'میرزایی', 'شیری', 'محمودی', 'حسنی', 'زارعی', 'جعفری', 'رضوانی', 'توکلی', 'ایزدی',
            'نادری', 'دهقانی', 'بهرامی', 'صالحی', 'امامی', 'رستمی', 'فراهانی', 'نصیری', 'سعادت', 'ترابی',
            'جوانمرد', 'فلاحی', 'حکمت', 'شهابی', 'نقی‌زاده', 'شاهی', 'عظیمی', 'غفاری', 'گل‌محمدی', 'محمودی',
            'برزگر', 'عسگری', 'جهانگیری', 'صالحی', 'مرادی', 'شاکری', 'پیروزی', 'ایمانی', 'نجفی', 'حجازی',
            'عباسی', 'علی‌نژاد', 'بمانی', 'شکری', 'مجیدی', 'شفیعی', 'مهرجو', 'کرمی', 'سالمی', 'آزادی'
        ];

        $faker = \Faker\Factory::create();

        return [
            'name' => $faker->randomElement($firstNames) . ' ' . $faker->randomElement($lastNames),
            'email' => $faker->unique()->safeEmail,
            'picture' => $faker->imageUrl(640, 480), // ایجاد URL فیک برای عکس
            'mobile' => '1' . $faker->numerify('990########'), // شماره تلفن با 19904421184 فرمت
            'remember_token' => Str::random(10),
        ];

    }

    /**
     * Indicate that the model's email address should be unverified.
     */
    public function unverified(): static
    {
        return $this->state(fn(array $attributes) => [
            'email_verified_at' => null,
        ]);
    }
}
