<section class="explain position-relative">
    <h3 class="text-primary fs-2">توضیحات دوره</h3>
    <div class="d-flex align-items-center gap-2 mt-5">
        <span class="explainTitleCircle p-2"></span>
        <h5 class="text-white m-0">دوره جاوا اسکریپت</h5>
    </div>
    <!-- explain Text -->
    <div class="exText text-white">
        جاوا اسکریپت یک زبان برنامه‌نویسی است که به صورت اصلی در مرورگرها
        اجرا می‌شود و برای افزودن انعطاف و تعامل به وبسایت‌ها و
        اپلیکیشن‌های وب مورد استفاده قرار می‌گیرد. این زبان امکاناتی از
        جمله تغییر دینامیک محتوا، اعتبارسنجی داده، تعامل با المان‌های صفحه
        و ارسال درخواست به سرور را ارائه می‌دهد. با استفاده از جاوا
        اسکریپت، می‌توانید به وبسایت‌ها زندگی بخشیده و تجربه کاربری را
        بهبود بخشید، افکت‌ها و انیمیشن‌های جذاب ایجاد کنید و از امکانات
        پیشرفته برنامه‌نویسی وب بهره‌مند شوید.
        <div class="my-3"></div>
        در مورد ویژگی‌های اصلی جاوا اسکریپت آمده است:
        <div class="my-3"></div>

        1. تعاملی بودن:جاوا اسکریپت به وبسایت‌ها امکان تعامل با کاربران را
        می‌دهد.
        <div class="my-3"></div>

        2. انیمیشن و افکت‌ها:با استفاده از جاوا اسکریپت، می‌توانید
        انیمیشن‌ها و افکت‌های جذاب به وبسایت‌ها اضافه کنید.
        <div class="my-3"></div>

        3. تغییر دینامیک محتوا: این زبان امکان تغییر محتوا و ویژگی‌های
        صفحات وب را بر اساس اقدامات کاربران فراهم می‌کند.
        <div class="my-3"></div>

        4. اعتبارسنجی داده جاوا اسکریپت قابلیت اعتبارسنجی داده‌ها را برای
        جلوگیری از ورود اطلاعات نامعتبر فراهم می‌کند.
        <div class="my-3"></div>

        5. تعامل با المان‌های DOMاین زبان به شما امکان کنترل و تعامل با
        المان‌های صفحه وب (DOM) را می‌دهد.
        <div class="my-3"></div>

        6. رویدادها با ایجاد واکنش به رویدادها مانند کلیک یا ورود موس،
        می‌توانید تعاملات کاربر را پیاده‌سازی کنید.
        <div class="my-3"></div>

        7. ارتباط با سرور (AJAX): امکان ارسال درخواست‌های آسنکرون به سرور
        و به‌روزرسانی صفحه بدون نیاز به بارگذاری مجدد را فراهم می‌کند.
        <div class="my-3"></div>

        8. متغیرها و داده‌ها: این زبان از متغیرها و انواع داده‌ها برای
        ذخیره و مدیریت اطلاعات استفاده می‌کند.
        <div class="my-3"></div>

        9. ساختار کنترل: با استفاده از شرط‌ها و حلقه‌ها، می‌توانید جریان
        اجرای برنامه را کنترل کنید.
        <div class="my-3"></div>

        10. توابع: امکان استفاده از توابع برای سازماندهی بهتر کد و استفاده
        تکراری را بهبود می‌بخشد.
        <div class="my-3"></div>

        11. تست و اشکال‌زدایی: ابزارها و متدهای مختلفی برای تست و
        اشکال‌زدایی کد در اختیار توسعه‌دهندگان قرار دارد.
        <div class="my-3"></div>

        12. کتابخانه‌ها و چارچوب‌ها :امکان استفاده از کتابخانه‌ها و
        چارچوب‌های مختلف برای تسهیل توسعه و کاهش زمان نوشتن کد را فراهم
        می‌کند.
        <div class="my-3"></div>

        13. سهولت یادگیری: به دلیل پراکنده بودن منابع آموزشی و جوامع بزرگ
        توسعه‌دهندگان، یادگیری جاوا اسکریپت به سهولت انجام می‌شود.
        <div class="my-3"></div>

        14. پشتیبانی گسترده: جاوا اسکریپت به عنوان یکی از زبان‌های اصلی
        وب، از پشتیبانی گسترده از طرف جوامع توسعه‌دهندگان برخوردار است.
        <div class="my-3"></div>

        15. قابلیت توسعه و گسترش: این زبان به توسعه‌دهندگان امکان افزودن
        ویژگی‌های جدید و گسترش قابلیت‌ها را می‌دهد.
    </div>
    <!-- More explain -->
    <div class="more d-flex justify-content-center align-items-center">
        <button class="show d-flex justify-content-center">
            <svg
                width="18"
                height="18"
                viewBox="0 0 18 18"
                fill="none"
                xmlns="http://www.w3.org/2000/svg">
                <path
                    d="M12.0969 6.26367L8.75 9.60326L5.40312 6.26367L4.375 7.2918L8.75 11.6668L13.125 7.2918L12.0969 6.26367Z"
                    fill="#23BF65" />
            </svg>
            <p class="m-0 text-primary fw-medium">ادامه مطلب</p>
            <svg
                width="18"
                height="18"
                viewBox="0 0 18 18"
                fill="none"
                xmlns="http://www.w3.org/2000/svg">
                <path
                    d="M12.0969 6.26367L8.75 9.60326L5.40312 6.26367L4.375 7.2918L8.75 11.6668L13.125 7.2918L12.0969 6.26367Z"
                    fill="#23BF65" />
            </svg>
        </button>
    </div>
</section>
