app/Livewire/Client/Basket/Index.php

select * from `baskets` where `user_id` is null
---
    public function mount()
    {
        $this->basket = Basket::query()
            ->with('course.teacher','course.coverImage')
            ->where('user_id', Auth::id())->get();