app/Livewire/Client/Header.php

    public function mount()
    {
        $this->basket = Basket::query()->where('user_id', Auth::id())->count();
        $this->categories = Category::query()
            ->where('active', '=', true)
            ->with('subCategories')
            ->whereNull('category_id')->get();
---
select count(*) as aggregate from `baskets` where `user_id` is null
select * from `categories` where `active` = 1 and `category_id` is null